#todo: Написать программу, которая считывает два числа и выводит их сумму, разность, частное, произведение,
# результат целочисленного деления, результат деления с остатком, результат возведения в степень.

x=10
y=2

print('Сумма: x+y = ', x+y)
print('Разность: x-y = ', x-y)
print('Деление: x/y = ', x/y)
print('Произведение: x*y = ', x*y)
print('Целочисленое деление: x//y = ', x//y)
print('Остаток от деления: x%y = ', x%y)
print('Возведение в степерь: x**y = ', x**y)





