# todo: Определить в коде переменные:
# 1. Целочисленного типа
x=1
print ('x=',x,' - type:',type(x))
# 2. Вещественного типа
x=1.
print ('x=',x,' - type:',type(x))
# 3. Логического типа
x= True
print ('x=',x,' - type:',type(x))
# 4. Строкового типа
x= 'True'
print ('x=',x,' - type:',type(x))
# 5. Пустого типа
x= ""
print ('x=',x,' - type:',type(x))
# Вывести их типы (надо погуглить).

